src/main/resources/request.xml

<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
  <soap2:Header xmlns:soap2="http://www.w3.org/2003/05/soap-envelope" xmlns:htng="http://htng.org/1.3/Header/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wss="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:htnga="http://htng.org/PWSWG/2007/02/AsyncHeaders" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <wsa:Action>http://htng.org/PWSWG/2010/12/ReservationSynch_SubmitRequest</wsa:Action>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <htnga:ReplyTo>
      <wsa:Address>HTTPS://INTEGCERT.SYNXIS.COM/INTERFACE/OTA2010AV2/OTA2010A.SVC</wsa:Address>
    </htnga:ReplyTo>
    <wss:Security mustUnderstand="1">
      <wss:UsernameToken>
        <wss:Username>YOUR ENDPOINT USERNAME</wss:Username>
        <wss:Password>YOUR ENDPOINT PASSWORD</wss:Password>
      </wss:UsernameToken>
    </wss:Security>
    <wsa:MessageID>ace76564-8f03-4201-8e45-cd2fba2bb6ce</wsa:MessageID>
    <htnga:CorrelationID>ace76564-8f03-4201-8e45-cd2fba2bb6ce</htnga:CorrelationID>
    <wsa:To>https://YOUR ENDPOINT WELL SEND TO</wsa:To>
  </soap2:Header>
  <Body>
    <OTA_HotelResNotifRQ EchoToken="34ca86b8-d3f7-483d-8c76-97d9456154cf" TimeStamp="2019-04-29T19:39:41.3553471+00:00" Version="5.000" ResStatus="Commit" xmlns="http://www.opentravel.org/OTA/2003/05" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <POS>
        <Source>
          <RequestorID Type="22" ID="Synxis">
          </RequestorID>
          <BookingChannel Type="7" Primary="true">
            <CompanyName Code="GC">Booking Engine</CompanyName>
          </BookingChannel>
        </Source>
      </POS>
      <HotelReservations>
        <HotelReservation RoomStayReservation="true" CreateDateTime="2019-04-29T19:36:51" CreatorID="Synxis" ResStatus="Reserved">
          <UniqueID Type="14" ID="XXXXXIC000041">
          </UniqueID>
          <RoomStays>
            <RoomStay MarketCode="RAC">
              <RatePlans>
                <RatePlan RatePlanCode="RACK">
                  <RatePlanInclusions TaxInclusive="false">
                  </RatePlanInclusions>
                </RatePlan>
              </RatePlans>
              <RoomRates>
                <RoomRate RoomTypeCode="DL1Q" NumberOfUnits="1" RatePlanCode="RACK" RatePlanCategory="1LRA">
                  <Rates>
                    <Rate EffectiveDate="2019-08-03" ExpireDate="xxxx" RateTimeUnit="Day" UnitMultiplier="1">
                      <Base AmountBeforeTax="140" CurrencyCode="USD">
                        <Taxes Amount="0" CurrencyCode="USD">
                        </Taxes>
                      </Base>
                    </Rate>
                  </Rates>
                </RoomRate>
              </RoomRates>
              <GuestCounts IsPerRoom="true">
                <GuestCount AgeQualifyingCode="10" Count="1">
                </GuestCount>
              </GuestCounts>
              <TimeSpan Start="2019-08-03" End="2019-08-04">
              </TimeSpan>
              <Guarantee GuaranteeCode="TAG" GuaranteeType="GuaranteeRequired">
                <GuaranteeDescription>
                  <Text>Guarantee to Travel Agency</Text>
                </GuaranteeDescription>
              </Guarantee>
              <Total AmountBeforeTax="140" CurrencyCode="USD">
                <Taxes Amount="0" CurrencyCode="USD">
                </Taxes>
              </Total>
              <BasicPropertyInfo ChainCode="SITC" HotelCode="1588">
              </BasicPropertyInfo>
              <ResGuestRPHs>
                <ResGuestRPH RPH="1">
                </ResGuestRPH>
              </ResGuestRPHs>
              <Comments>
                <Comment GuestViewable="true">
                  <Text>
                  </Text>
                </Comment>
              </Comments>
            </RoomStay>
          </RoomStays>
          <ResGuests>
            <ResGuest ResGuestRPH="1" PrimaryIndicator="true">
              <Profiles>
                <ProfileInfo>
                  <UniqueID Type="1" ID="XXXXXGN000032" ID_Context="crs">
                    <CompanyName Code="6835" CodeContext="chain">
                    </CompanyName>
                  </UniqueID>
                  <Profile ProfileType="1">
                    <Customer>
                      <PersonName>
                        <NamePrefix>Mr.</NamePrefix>
                        <GivenName>Test</GivenName>
                        <Surname>Test</Surname>
                      </PersonName>
                      <Telephone PhoneTechType="1" PhoneNumber="3235387777" FormattedInd="false" DefaultInd="true">
                      </Telephone>
                      <Email>michael@theguestbook.com</Email>
                      <Address Type="1" Remark="Personal">
                        <AddressLine>555 Ocean Ave</AddressLine>
                        <CityName>Westhollywood</CityName>
                        <PostalCode>90069</PostalCode>
                        <StateProv StateCode="CA">
                        </StateProv>
                        <CountryName Code="US">
                        </CountryName>
                      </Address>
                    </Customer>
                  </Profile>
                </ProfileInfo>
              </Profiles>
            </ResGuest>
          </ResGuests>
          <ResGlobalInfo>
            <HotelReservationIDs>
              <HotelReservationID ResID_Type="14" ResID_Value="XXXXXIC000041" ResID_Source="CRS" ForGuest="true">
              </HotelReservationID>
            </HotelReservationIDs>
          </ResGlobalInfo>
        </HotelReservation>
      </HotelReservations>
    </OTA_HotelResNotifRQ>
  </Body>
</Envelope>